[{"model": "blog.comment", "pk": 1, "fields": {"creator": 1, "content": "school of ass-kickery", "content_type": 8, "object_id": 1, "created_at": "2024-01-18T04:08:01.166Z", "modified_at": "2024-01-18T04:08:01.166Z"}}, {"model": "blog.comment", "pk": 2, "fields": {"creator": 1, "content": "Luka Mvp", "content_type": 8, "object_id": 1, "created_at": "2024-01-18T04:08:15.612Z", "modified_at": "2024-01-18T04:08:15.612Z"}}, {"model": "blog.comment", "pk": 3, "fields": {"creator": 1, "content": "booker is a crybaby", "content_type": 8, "object_id": 1, "created_at": "2024-01-20T02:21:58.105Z", "modified_at": "2024-01-20T02:21:58.105Z"}}, {"model": "blog.tag", "pk": 1, "fields": {"value": "luka, nba, ass-kickery, phoenix"}}, {"model": "blog.tag", "pk": 2, "fields": {"value": "luka, nba, all-star"}}, {"model": "blog.tag", "pk": 3, "fields": {"value": "nba\r\ncenters\r\ndwight"}}, {"model": "blog.tag", "pk": 4, "fields": {"value": "trade rumors"}}, {"model": "blog.post", "pk": 1, "fields": {"author": 1, "created_at": "2024-01-17T19:34:30.379Z", "modified_at": "2024-01-21T06:02:09.764Z", "published_at": "2023-12-25T19:31:35Z", "title": "Luka is Phoenix's Boogeyman", "slug": "me-destroy-phoenix", "summary": "Luka owned the Phoenix suns in WCF Game 7 and NBA 2023 season Christmas Day", "content": "PHOENIX -- — It was no surprise when Luka Doncic looked ready for Game 7, calmly draining his first three shots to give the Dallas Mavericks an early lead.\r\n\r\nThe stunner came over the next two hours: The top-seeded Phoenix Suns had no response.\r\n\r\nDoncic scored 35 points, Spencer Dinwiddie added 30 and the Mavericks blitzed the Suns with a 123-90 knockout Sunday night, advancing to the Western Conference finals for the first time since 2011.\r\n\r\nIt's the season of giving, and Luka Doncic exemplified that on Christmas Day by giving the Phoenix Suns many buckets during the Dallas Mavericks' 128-114 win on Monday.\r\n\r\nIn the win, which moved the Mavs to 18-12 on the season and fifth in the Western Conference standings, Doncic finished with 50 points, six rebounds, 15 assists, four steals and three blocks while shooting 15-25 overall, 8-16 from deep and 12-12 from the free-throw line. He also became the fastest active player to reach 10,000 career points.", "tags": [1]}}, {"model": "blog.post", "pk": 2, "fields": {"author": 4, "created_at": "2024-01-17T19:36:43.581Z", "modified_at": "2024-01-21T05:57:17.887Z", "published_at": "2024-01-16T19:41:59Z", "title": "Mavs' Luka Doncic Leads All Guards in NBA All-Star Voting; Kyrie Irving 5th in West", "slug": "mavs-luka-doncic-leads-all-guards-in-nba-all-star", "summary": "Mavs superstar Luka Doncic leads all guards in the first return of NBA All-Star voting, while Kyrie Irving has a strong case for a nomination.", "content": "DALLAS — The first wave of NBA All-Star fan voting results was released on Thursday, featuring Dallas Mavericks superstar Luka Doncic, who received more votes than any other guard. Kyrie Irving ranked fifth among Western Conference guards. \r\n\r\nWith 1,452,733 votes, Doncic leads over Stephen Curry, who has garnered 1,394,980 votes, and Shai Gilgeous-Alexander with 966,927 votes. It will be a competitive landscape among those three players for the two starting guard positions from the Western Conference.", "tags": [2]}}, {"model": "blog.post", "pk": 3, "fields": {"author": 2, "created_at": "2024-01-17T19:38:33.275Z", "modified_at": "2024-01-18T02:34:13.938Z", "published_at": "2024-01-12T19:41:39Z", "title": "Mavericks' Dwight Powell: Back to bench with Lively's return", "slug": "mavericks-dwight-powell-back-to-bench-with-livelys", "summary": "Powell will come off the bench for Monday's game against the Pelicans due to Dereck Lively (ankle) returning from a five-game absence, Mark Followill of Bally Sports Southwest reports.", "content": "Powell will come off the bench for Monday's game against the Pelicans due to Dereck Lively (ankle) returning from a five-game absence, Mark Followill of Bally Sports Southwest reports.\r\n\r\nThe veteran center started Dallas' past five games, averaging 5.0 points, 7.4 rebounds, 4.0 assists and 1.6 steals in 27.6 minutes. But with Lively back, Powell will return to a bench role -- one not conducive to fantasy value.", "tags": [3]}}, {"model": "blog.post", "pk": 4, "fields": {"author": 2, "created_at": "2024-01-21T00:45:28.076Z", "modified_at": "2024-01-21T00:45:28.076Z", "published_at": "2023-12-01T00:41:00Z", "title": "Please dont trade me", "slug": "please-dont-trade-me", "summary": "The Dallas Mavericks center appeared to catch his head on the frame of a doorway at the team's arena.", "content": "Dwight Powell has gone viral on social media, but not for the reasons the NBA star might have hoped for.\r\n\r\nThe Dallas Mavericks center featured in a video that has spread like wildfire on X, formerly known as Twitter, after appearing to accidentally catch his head on the frame of a doorway at the team's arena.\r\n\r\nHe can be seen hopping and skipping through the tunnel in his warmup gear as he readied himself for action at the American Airlines Center.\r\n\r\nAs the camera turns to the right, he uses the spring in his step to execute a giant leap on the frame of the hallway - and gets a nasty surprise when his head collides with the ceiling.\r\n\r\nFortunately, the Mavericks confirmed he was able to avoid sustaining any injury from the incident. But if it was supposed to bring his team luck, it didn't - they fell to a 122-96 defeat to the Houston Rockets and Powell was one of three players on his team not to score a point.", "tags": [3]}}, {"model": "blog.post", "pk": 5, "fields": {"author": 3, "created_at": "2024-01-21T00:47:44.908Z", "modified_at": "2024-01-21T06:02:49.515Z", "published_at": "2024-01-20T00:46:44Z", "title": "Mavs Trade Rumor: Dallas 'Linked' to Reunion with Dorian Finney-Smith", "slug": "mavs-trade-rumor-dallas-linked-to-reunion-with-dor", "summary": "With the Dallas Mavericks reportedly in the market for an upgrade at the forward position, could former MFFL favorite Dorian Finney-Smith be in play?", "content": "With just under three weeks remaining until the NBA trade deadline, the rumors and speculation is starting to swirl, and the Dallas Mavericks seem to be involved in many of them.\r\n\r\nCurrently, the Mavs sit as the No. 6 team in the Western Conference, but to truly enter contender status among the top teams in the league, Dallas needs to amp up its defense on the perimeter.\r\n\r\nOn Wednesday, Yahoo! Sports' Jake Fischer reported that while the Mavs had conversations with Toronto regarding Pascal Siakam before he was traded to the Indiana Pacers, there remains to be several veteran forwards that Dallas has its eye on, including an 'old friend.'\r\n\r\n\"The Mavericks continue to be linked to various versatile forwards, from Andrew Wiggins to P.J. Washington to old friend Dorian Finney-Smith, according to league sources,\" Fischer wrote.\r\n\r\nFor the Mavs, when the Kyrie Irving trade was made, it felt as if the city of Dallas was almost equally excited for Irving's arrival and upset for DFS's departure -- that's how much the MFFL's and the Mavs' organization loved Finney-Smith.\r\n\r\nOn the season, Finney-Smith is averaging 9.4 points, 4.8 rebounds, and 1.3 assists per game while shooting a career-high 40.1 percent from downtown in just under 29 minutes per game. Needless to say, he'd still fit in like a glove in Dallas.\r\n\r\nThough the Mavs may have interest in reuniting with Finney-Smith, they'll be one of many teams in the market for the eight-year veteran who can fill a 3-and-D need for any contending team. With that in mind, what would be the cost for Dallas to bring Finney-Smith back?\r\n\r\nHoopsHype's Michael Scotto reported last week that in a trade for Finney-Smith, the Nets want the 'equivalent of two first-round picks.'\r\n\r\nFor Dallas, two first-round picks for Finney-Smith feels like too high of a price to pay, especially considering that a 2029 first-round pick was attached to him in order to get Irving on the Mavs. But, Dallas could offer Brooklyn a choice of Grant Williams or Richaun Holmes for salary filler along with either Jaden Hardy or O-Max Prosper and one future first-round pick ... or perhaps even a pick swap.\r\n\r\nIf the Mavs could shed the contracts of either Williams or Holmes along with keeping their preference of Hardy or Prosper, bringing back Finney-Smith at that cost feels like a worthy investment. Let's see how the market plays out over the next few weeks.", "tags": [4]}}, {"model": "blog.post", "pk": 6, "fields": {"author": 1, "created_at": "2024-01-21T00:48:50.781Z", "modified_at": "2024-01-21T00:48:50.781Z", "published_at": "2024-01-18T00:48:44Z", "title": "2024 NBA trade deadline guide: What the Dallas Mavericks could (or should) do", "slug": "2024-nba-trade-deadline-guide-what-the-dallas-mave", "summary": "With the deadline roughly three weeks away, trade season has already begun, and with half of the regular season already played, it is increasingly clear which direction every NBA team is headed in.", "content": "After a bit of unrest in recent seasons, the Mavericks are in quite a nice place currently, and it perhaps works in their favor that they have such distinct needs.\r\n\r\nSpecifically, it is widely understood at this point that they are in the hunt for frontcourt additions to pair with the foundational duo of Luka Doncic and Kyrie Irving. Rookie Dereck Lively is doing a very solid job in his first season at protecting the paint and clearing the glass, but the declines and injuries of Maxi Kleber and Dwight Powell are leaving him too often on his own. And with due respect to the solid Derrick Jones Jr, the power forward spot is a work in progress, both immediately and in the future.\r\n\r\nDallas’s cupboard of potential trade assets with which to recruit this help is not the best. They owe a lot of future draft capital to other teams, and at best could offer either their 2026 or 2027 first-round pick and Toronto’s 2025 second-rounder, which is not a great starting point to build trades around. Josh Green, Olivier-Maxence Prosper, and Jaden Hardy have had their moments, but have not cemented their places on the team, and nor have Richaun Holmes or Seth Curry, who have disappointed. Therefore, while the long-standing Tim Hardaway Jr is a valuable and important shooter and not someone Dallas will want to be parted from, he and his 2024/25 salary of $16,193,183 might prove to be important outgoing pieces in a deal. After all, his value is not negative.\r\n\r\nThey may have missed out on both Pascal Siakam and OG Anunoby, but the Mavericks are still shopping what they can. Expect something to get over the line before the deadline, something bigger and more productive than the acquisition of Grant Williams. The money is there, even if the draft capital isn’t.", "tags": [4]}}, {"model": "blango_auth.User", "pk": 1, "fields": {"password": "argon2$argon2id$v=19$m=102400,t=2,p=8$RWNHV0ZsWlU1bFJHTmxsZGo1YlJkaw$sKnE9mI7YU4v50vRKe/fDQ", "last_login": "2024-01-21T00:31:16.883Z", "is_superuser": true, "username": "luka", "first_name": "luka", "last_name": "doncic", "email": "luka@mavs.com", "is_staff": true, "is_active": true, "date_joined": "2024-01-17T19:23:20Z", "groups": [], "user_permissions": []}}, {"model": "blango_auth.User", "pk": 2, "fields": {"password": "argon2$argon2id$v=19$m=102400,t=2,p=8$REZVQ1Yyak1nWDBNbndnODlTZmR1Sw$fpFyZ+U6F7MObrxB9HPGuQ", "last_login": null, "is_superuser": false, "username": "volleyball", "first_name": "<script>alert('pilyo si dwight')</script>", "last_name": "<b>POWELL</b>", "email": "powell@mavs.com", "is_staff": true, "is_active": true, "date_joined": "2024-01-17T19:30:40Z", "groups": [], "user_permissions": []}}, {"model": "blango_auth.User", "pk": 3, "fields": {"password": "argon2$argon2id$v=19$m=102400,t=2,p=8$MVdmQ0FzcXc5TU1JeWVZbnNhQXp1Rw$UPWNTGPy0rElUiCOvsrOCg", "last_login": null, "is_superuser": false, "username": "Kye", "first_name": "Kyrie", "last_name": "Irving", "email": "irving@mavs.com", "is_staff": false, "is_active": true, "date_joined": "2024-01-21T05:51:42Z", "groups": [], "user_permissions": []}}, {"model": "blango_auth.User", "pk": 4, "fields": {"password": "argon2$argon2id$v=19$m=102400,t=2,p=8$NWdWOWZPV04ycWt6UkRLTE5IVWtsdQ$S0NJPHwFytCJhkK6J2PLVw", "last_login": null, "is_superuser": false, "username": "dirk", "first_name": "Dirk", "last_name": "Nowitzki", "email": "dirk@mavs.com", "is_staff": false, "is_active": true, "date_joined": "2024-01-21T05:56:41Z", "groups": [], "user_permissions": []}}]